In [1]:
import pandas as pd

In [6]:
data = [[1,'a'],[2,'b'],[3,'c'],[4,'d'],[5,'e'],[6,'f'],[7,'g'],[8,'h'],[9,'i'],[10,'j']]

In [7]:
df = pd.DataFrame(data, columns = ["Emplyoee ID","Employee Name"])

In [8]:
df

   Emplyoee ID Employee Name
0            1             a
1            2             b
2            3             c
3            4             d
4            5             e
5            6             f
6            7             g
7            8             h
8            9             i
9           10             j

In [9]:
df.head()

   Emplyoee ID Employee Name
0            1             a
1            2             b
2            3             c
3            4             d
4            5             e

In [10]:
df.tail()

   Emplyoee ID Employee Name
5            6             f
6            7             g
7            8             h
8            9             i
9           10             j

In [11]:
df.describe()

       Emplyoee ID
count     10.00000
mean       5.50000
std        3.02765
min        1.00000
25%        3.25000
50%        5.50000
75%        7.75000
max       10.00000

In [12]:
df.info

<bound method DataFrame.info of    Emplyoee ID Employee Name
0            1             a
1            2             b
2            3             c
3            4             d
4            5             e
5            6             f
6            7             g
7            8             h
8            9             i
9           10             j>